[
    {
        "title": "The Entire AI Buildout (Google, NVDA, MSFT) Is dependent on this $700m Monopoly - $15 -&gt; $150 PT.",
        "url": "https://www.reddit.com/gallery/1pyghud",
        "post_text": "I drew colossus from Starcraft 2 to represent laser beams. And prepared a whole thesis but kept getting automodded for \"low quality\".  So here's the more TLDR version of my thesis:  \n  \nThe Entire AI Industry is shifting to photonics from Google TPU to optical interconnects. \n\nThe entire AI \"Growth\" story ends in 2026 if there's no InP substrates + materials.  \n\nBUT GUESS WHO CONTROLS IT ALL? One Company: $AXTI. \n\nThere's two bottlenecks:\n\nInP Substrates -   \n  \n\\- Hyperscaler optics (TPU pods, etc)   \n\\- Optical transceivers (5g, data)   \n\\- LiDAR (robotaxis, drones, military)   \n\\-Optical Modules (interconnect clusters)   \n\\- Silicon photonics laser dies (Nvidia’s future co-packaged optics and Intel/Broadcom SiPh engines use InP CW laser arrays.)  \n  \nThis is a DUOPOLY  from  \n\\-AXTI (est. \\~30–35%)   \n\\-Sumitomo (est.\\~30%)   \n\\- JX Nippon (est. 10-15%)\n\nIndium Phosphide (the source material for everything): \n\nVital Materials - 35%   \nAXT - 25%  \n  \nBefore, this was a commodity with low TAM just for telecom.\n\nNow they're used for the entire AI buildout. \n\nJust to give u an example $AXTI -&gt; $LITE -&gt; $GOOGL TPU. without any of these members, the program shuts down.   \n  \nGoogle would literally pay $5B (50 TIMES prices + \\~$140m TAM from 2024) DIRECTLY to one of these suppliers -&gt; hand to COHR just so their whole TPU program doesn't stall because Meta decided to buy them out. And this would only be a like a 3-4% added cost to their BOM because this thing was so cheap. If Meta does it first, then Google's TPU program stalls. If Google does it first Microsoft's ASIC problem stalls.   \n  \nTHE WORLD IS AT MAX CAPACITY RIGHT NOW (demand &gt; supply by multiple factors pre-ramp) AND THIS IS GAME THEORY on materials supply chains. \n\nGuess who shows up twice in the WHOLE AI bottleneck? Both as the duopoly bottleneck and the duopoly bottleneck of the bottleneck\n\nAXTI.   \n  \nThis is the holy grail of supply chain analysis + materials research. Nobody's posted about this stock here in the past 5 years, you're welcome. \n\nAnyway I decided to max OTM some spare change on Calls last Friday, because there's a low chance this goes from $15 to $150 if we see the same memory supply stock in 2026. I will buy more shares on Monday when markets open up but wanted to share this at the start as proof. \n\nNFI, there's a chance China sends this to $0 with export controls so don't follow along I just wanted to share my thoughts. But if this goes to $0 so does the entire growth phase of the AI buildout.   \n  \nI just thought this could also easily be a $7B company given they control 1/3rd of the world's entire substrate capacity and then 1/4th of the world's entire materials used for AI buildout.  \n  \nIt's a monopoly in mining -&gt; refining -&gt; substrate production. And a duopoly for InP substrate production and Indium Phosphide. \n\n I just wanted to share as proof in case this becomes legendary.   \n  \nTLDR: THE ENTIRE AI INDUSTRY IS BOTTLENECKED TWO TIMES BY THE SAME COMPANY. \n\nFOUND THE SINGLE POINT OF FAILURE OF THE ENTIRE MANY TRILLION USD WESTERN AI BUILDOUT IS SOME $700m COMPANY CALLED AXTI, WORTH LESS THAN SOME PRE REVENUE LLM STARTUP. ",
        "created_utc": 1766995211.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 737 | **Previous Best DD** | [x](https://www.reddit.com/gallery/1kkhrp7) [x](https://www.reddit.com/gallery/1kmpolu) [x](https://www.reddit.com/gallery/1km1t8b) [x](https://www.reddit.com/gallery/1kms151) [x](https://www.reddit.com/gallery/1kbdbfk) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Penny stock up 630% in 6 months. Thanks for the tip. ",
            "https://preview.redd.it/ql2we9fbp3ag1.png?width=2008&amp;format=png&amp;auto=webp&amp;s=1dc58fd4c711805df589a1f6dd7228ebfdde5586",
            "One little thing from AXT's \"investors\" page.\n\n*AXT’s worldwide headquarters are* ***in Fremont, California*** *and includes* ***sales, administration and customer service functions****. AXT’s* ***subsidiary in China (“Tongmei”)*** *has similar functions as well as* ***manufacturing facilities to produce wafer substrates****. In addition, as part of the supply chain strategy, AXT,* ***Tongmei and Tongmei subsidiaries collectively have partial ownership in ten companies in China producing raw materials****.*  \n[https://investors.axt.com/Investors/Overview/default.aspx](https://investors.axt.com/Investors/Overview/default.aspx)\n\nChina controls this thing by controlling export permits for Beijing Tongmei Xtal Technology Co Ltd (not listed anywhere):  \n[https://www.bloomberg.com/profile/company/ZBAYJZ:CH](https://www.bloomberg.com/profile/company/ZBAYJZ:CH)  \n[https://www.semiconductor-today.com/news\\_items/2025/aug/axt-tongmei-200825.shtml](https://www.semiconductor-today.com/news_items/2025/aug/axt-tongmei-200825.shtml)",
            "&gt;THE ENTIRE AI INDUSTRY IS BOTTLENECKED\n\nlolwut.  umm... no.\n\nand this is such a good take that insiders have been rampantly dumping, especially their ceo.",
            "For those wondering, this company is entirely reliant on their office in Beijing for the Indium Phosphide. It's an obvious export restriction candidate and you are playing on that risk",
            "the CEO can't stop selling, this is signaling lack of faith in the business tbh. If he really expects to ramp up next year then he would not sell this aggressively.",
            "So why didn’t anyone acquire this company for the past two years? \n\nI call bullshit",
            "Country with domestic supply chain issues outsources mine to China. \n\nMany such cases. \n\nLet’s hope, for your sake, globalization prevails.",
            "The 265 volume in pm is probably all wsb. Congrats regards, you pumped it another 3%"
        ]
    },
    {
        "title": "I’m so good at this!",
        "url": "https://i.redd.it/zml0vanat1ag1.jpeg",
        "post_text": "Everything was looking great in September I was around 18k. Almost got all my money back and then I decided to use margin on HIVE and BITF. Worst timing ever. Wish I never touched margin. I would at least have unrealized losses that I can hold. It’s not the end of the world but it’s definitely a lesson to play it safe. I’m just gonna pick some stocks / crypto that I think have potential and just hold. This is all without using options as well lmao",
        "created_utc": 1766972790.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 7 months ago\n**Total Comments** | 21 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Still got 2.6k left, you’re not done",
            "You inspire me",
            "What did you learn retard?",
            "You still have $3.6k. It’s not over until it’s completely wiped out.",
            "2.6k left. 0DTE puts SPY 680 today. Trust me. Please credit me in your 2.6 -&gt; 100k post",
            "Lookin like me homie .. not good for either of us",
            "You need to show everyone how you did it.",
            "Lmk what you do next so i can do the opposite",
            "You still have $2600 left try 0dte SLV options and hope for 1000% return"
        ]
    },
    {
        "title": "I don’t recommend 0dte gambles",
        "url": "https://i.redd.it/mw2l06i4r1ag1.jpeg",
        "post_text": "",
        "created_utc": 1766972060.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Did you get the 2$ of btc from robinhood",
            "I don’t touch options for this exact reason. Cause I know with all my little knowledge that whatever I choose (calls, puts) it doesn’t matter. The market will 100% bend me over and fuck my options.",
            "50% lost on 0DTEs? Thats nothing compared to the 1000% you can gain on 0DTEs. Keep mining brother",
            "Bro you're lucky a post behind you lost 90% of his port 😂😂😂 Now don't touch 0dte and go back to option or stock lol ",
            "but what if?",
            "I lost 70% of my money due to medical bills and divorce, but I made $75 with a 0DTE gamble",
            "https://preview.redd.it/hotpkcwi02ag1.jpeg?width=481&amp;format=pjpg&amp;auto=webp&amp;s=24e8285315333289ddb01e4ad69901272f75eabb",
            "Hey man great job keep it up! You just saved a ton on taxes",
            "https://preview.redd.it/1plndcaur1ag1.jpeg?width=945&amp;format=pjpg&amp;auto=webp&amp;s=b5976a99f0a732fa40a8d58dc115713b50df7996"
        ]
    },
    {
        "title": "First time dabbling with futures",
        "url": "https://i.redd.it/bxickgp6p1ag1.jpeg",
        "post_text": "Of course I bought at the absolute peak and then there was a market correction. I’m fairly confident the price will come back up within the next couple weeks but now my account is in a deficit and I’m probably getting margin called tomorrow. Will Robinhood make me close this position? Or will I have a choice on what to sell? I’ve never been margin called before",
        "created_utc": 1766971408.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 5 months ago\n**Total Comments** | 6 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Only on WSB can someone get margin called on something that is up 165% YTD and 15% THIS WEEK.",
            "Forgot to mention this is micro silver futures lol",
            "will robinhood make me close this position : if your account is in deficit yes they will and they probably wont wait for you to do it \n\n\ndo i have a choice on what to sell : no\n\n\nim fairly confident the price will come back up : the market doesnt care\n\n\nyou must sell the position yourself before they do If you login and close the position manually right now you control the exit price and quantity  If you wait for them they will sell at the current market price which could be unfavorable",
            "BRO REALLY FOMO’D SILVER AT THE TOP WITH FUTURES THIS REALLY IS WALLSTREETBETS",
            "Good dabbling , use margin for sure",
            "When the gords getting delivered?",
            "I already knew it's silver without even looking at the ticker.",
            "I've been red since 2011",
            "Just wait it out with futures. You can’t be a bitch. I’ve been killing it with them"
        ]
    },
    {
        "title": "MSOS-YOLO for Q1 2026",
        "url": "https://i.redd.it/qb52cjdiq1ag1.png",
        "post_text": "Locking in for Q1 2026. Signed executive order will expedite the rescheduling process. ",
        "created_utc": 1766971949.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1496 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "This may take the cake for dumbest play on here",
            "good luck but im skeptical",
            "Were you high when you bought it?",
            "MOASS INCOMING!",
            "Prob better to go Tilray if you’re yoloing. Has more big move potential."
        ]
    },
    {
        "title": "$SLV 92%",
        "url": "https://i.redd.it/ytdgm0nv5w9g1.jpeg",
        "post_text": "91% gains since September. I can’t remember why I bought, but I’m happy I did.",
        "created_utc": 1766904381.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 21 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "I remember there was a post here few years back complaining her husband is all in Silver and no other stocks. All the advice for her was to leave husband and get a divorce.",
            "I have 62 oz of physical I bought in 2015 lol",
            "Better off to buy PSLV. \n.\nSLV is used to short silver by the by the Bullion Banks, so it works against you.\n\nSILJ will do better than SLV in 2026 and beyond because silver miners will have huge profits due to silver's price rise. Latest silver price is not factored into SILJ yet.",
            "Your SLV calls will gamma squeeze the price higher forcing shorts for physical to also get Fked :D\n\n  \nThis is insanity!",
            "When this unwinds the stage 3 to stage 4 transition is going to be wild.",
            "Flooded with silver posts after a 170% ytd run in the middle of a parabola \n\n\nDefinitely dump incoming",
            "[deleted]",
            "Nice gains",
            "Looking good, I will check it out, thank you"
        ]
    },
    {
        "title": "100% Gain YTD - What’s your 2026 pick?",
        "url": "https://www.reddit.com/gallery/1px7uy0",
        "post_text": "- Bought $RKLB during liberation week. Already made a post on WSB about it. Check my profile. \n- Lost a shit ton on $QURE\n- Made some of it back shorting $RGTI\n\nRight now I’m sitting at roughly 80% T-Bills, 20% S&amp;P500. Let me know if you have any suggestions or any companies you like. \n\nProof included in the pictures. ",
        "created_utc": 1766867651.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 56 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "I don't like these green posts, I connect more with the red ones. 🤷‍♂️",
            "This is not regarded. Actually knows how to park money in SGOV after huge gains. You do not belong here.",
            "https://preview.redd.it/0t0cnkc35t9g1.jpeg?width=1320&amp;format=pjpg&amp;auto=webp&amp;s=9169418faf1c9bd93f760405ecd4163b90e1f6e0",
            "META, AMZN, NBIS, CRWV, SOFI, AMD, IBIT",
            "AVGO",
            "AMZN",
            "Netflix and Meta they have been lagging but they will catch up",
            "ONDS!",
            "ASTS"
        ]
    },
    {
        "title": "All in on oil 🛢️ for 2026",
        "url": "https://i.redd.it/72g07zsz2t9g1.jpeg",
        "post_text": "Okay listen up here bros. First of all, no I am not trying to pump my “bags”. Even if all of you brokies liquidated everything and went into CNQ on Monday at open, it wouldn’t move it a needle. With that being said, I know you are all busy chasing shiny metals right now but going into 2026, I believe that energy equities could outperform. Oil has pretty much been eating shit all year and is currently sitting at around $55 (crude). Yes, an entire barrel of oil is now cheaper than an ounce of silver. Read that again. Can it go lower? Sure. Is it sustainable? No. I think in hindsight, this will have been obvious. Sometimes, things are cheap enough. \n\nWhy am I bullish on oil? \n\nWell, I listen to and read a lot of what old and rich boomers have to say when I am bored and a lot of them seem to be bullish on it. I will try to keep this short and concise. In no particular order :\n\n1. The massive \"supply glut\" is overstated and demand is not as weak as forecasted either. Even the IEA which have been historically bearish recently moved their goalpost on peak oil demand from 2030 to 2050 (not that IEA has any real credibility. They have been wrong on their oil demand forecasts for like 17 years in a row).\n\n2. Most of the world's oil supply growth since the shale revolution came from US shale. There is real evidence that suggest that shale production has peaked (or is close). Their best assets are facing major depletion and at current oil prices, contrary to what the Mango man wants, their production will not be growing.\n\n3. XLE makes up less than 3% of SPY. Just going back to the historical average of 6\\~8% would imply massive gains for the equities. The bullish case is not necessairly dependent on crude hitting $100.\n\n4. Seasonality. Crude typically has strong seasonality in Q1.\n\n5. Any geopolitical risks are just a bonus at this point.\n\nOne of my favorite boomers to listen to, Rick Rule, says that you don't need to go far down the quality trail when it comes to oil equities. He thinks XOM is selling at 60% of NPV, meaning at 40% discount. I'm personally all in on CNQ which is a Canadian oil sands giant. The Canadian O&amp;G stocks trade at an even further discount to the US peers because of our political incompetence but Carney is a smart man and understands how important our oil and gas sector is to our economy and I'm betting that he will enable them. He has already reversed some of the Trudeau era policies and I think this is why they have been outperforming the US O&amp;G names. I'm also Canadian myself and there are tax advantages for holding TSX stocks. \n\nHere’s some random tickers to consider since a rising tide lifts all boats. \n\nXOM / CVX / COP / CNQ / SU / OXY / DVN \n\nAnyways, that's it for now. I'm off to play some poker. See you degens on Monday.",
        "created_utc": 1766867089.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 1036 | **Previous Best DD** | \n**Account Age** | 14 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Bro is cooked. We steal oil tankers from Venezuela now.",
            "Adjusted for inflation Oil is probably like $10 per barrel now",
            "clowning in the comments is bullish",
            "What? Why?\nDemand is down and is gonna trend down all of 2026.  \n\nWhat happens in a declining price environment is countries like Nigeria or Angola (among others, many OPEC members) whose economies are almost entirely based on oil production can't adjust to lower prices.  So what do they do?  They produce more to make up for the lower prices, increasing supply, driving down price more.  \n\nOPEC likes to act like they have control over these producers and gives them quotas on paper, which are just ignored.  Then you add in all the shadow production coming out of Russia, Venezuela and others and that murkies the waters even more.  This bottom is nowhere near.  And once $49 hits, those producers will really crank up the cheap barrel production.  \n\nWhen oxy hits about $24, that's when I'll start buying.",
            "im w/ you on this :-)",
            "Oh like everyone thought oil prices would balloon to triple digit during the Iran Israel war? \n\nAin’t happening broski. Unless a fucking meteor crashes into Saudi Arabia there’s no major spike to prices coming. It definitely could go back up to the 60s range but over $65 is fantasy",
            "https://preview.redd.it/98bwmd4qlu9g1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=27445da9b4f446d723ad097dc322be25ecd85990",
            "[deleted]",
            "Cop &amp; dvn seems strong buy in an oil reversal scenario.\n\nOxy is the dark horse, under 36 i'll consider starting a position."
        ]
    },
    {
        "title": "11k to 86k YoY thanks to Silver and Gold",
        "url": "https://www.reddit.com/gallery/1px2gzs",
        "post_text": "SLV",
        "created_utc": 1766854387.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Lol all us silver stackers celebrating after 5 or 10 years just to see some WSB regard match our return in a few days on some options play 😭😭",
            "Seeing gold and silver posts on WSB is absolutely hilarious 😂\n\nHell ya man congratulations!!!! Don't forget the miners! (But be careful with those, buy producers with high FCF)",
            "Silver will go to 250/oz in 2026. \nGold will go to 8000/oz in 2026. \n\n\n\n\n\nIt will not be a straight shot up. \n\n\nMark my words, and revisit this post next year.\n ",
            "https://preview.redd.it/v8bh0wmn1s9g1.jpeg?width=843&amp;format=pjpg&amp;auto=webp&amp;s=b531fef7b9d74ba7addf091564ad1276529b6210\n\nCongratulations! Keep up the good work!",
            "Is this the $oros moment when he says \"if you see a bubble run to it\" or is this the moment where I do something stupid and end up in tears?\n\nIf there's one thing I've learned in any asset class the trend will run much longer and farther than can be initially imagined. Is this that?",
            "I dumped my SLV calls a week ago at +100%. I still had 77 days to expiration. I feel like I missed Bitcoin  again lol. ",
            "So many silver posts, dump has to be coming soon.",
            "I want to bet on $SLV. But doesn't that mean the Citadel algos will sniff that out and go against me?",
            "Ya but it's Canadian dollars."
        ]
    },
    {
        "title": "The SLV and WBD gains crowd should really be thanking me. Held SLV since summer 2020 and got WBD from the T merger. Sold 2024.",
        "url": "https://i.redd.it/2n3qzo5kys9g1.jpeg",
        "post_text": "",
        "created_utc": 1766865626.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 5 years ago\n**Total Comments** | 3054 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "As always:\n\n1. Whatever I buy drops. \n\n2. Whatever I sell goes nuclear. \n\n* Held T. Did nothing. Still holding.\n\n* Held PSKY. Does nothing. Still holding.\n\n* Sold UPRO Q1'26. It goes nuclear.\n\n* Sold BRZU from 2021-23 in Q1'26. It goes nuclear. \n\n* Sold UWM this fall that I've been holding since 2020. Went nuclear literally days after I sold.\n\nNot investment advice.",
            "Bro",
            "you hold nothing except paper.",
            "What have you sold recently",
            "Congrats, but CUSIP/ISIN are not personally identifiable information (it's just a security ID, like a globally unique ticker symbol). You don't need to photoshop it out. :D",
            "Gracias hermano respecto",
            "ZSL symbol lets go!",
            "Had this been my move  \nThen harakiri is next  \nA haiku sort of",
            "Thank you for your service. Please DM me if you are thinking about buying back in. I’m considering selling and that would be a good sell signal"
        ]
    },
    {
        "title": "u/DrSeuss1020 inspired me to do a $PCT follow up - Riding with Valerie to Mars!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1px6pa3/udrseuss1020_inspired_me_to_do_a_pct_follow_up/",
        "post_text": "Fellow big balled braveheart u/DrSeuss1020 made a very insightful post on one of my largest positions - safe to say I agree with it all. (see here: [https://www.reddit.com/r/wallstreetbets/comments/1prtk9e/pct\\_120k\\_yolo\\_ive\\_been\\_early\\_before/](https://www.reddit.com/r/wallstreetbets/comments/1prtk9e/pct_120k_yolo_ive_been_early_before/)  )\n\n\n\nHad some folks ask if I was still in trade/update. Ofc I am my brothers in christ. \n\nBought a little on the Valerie news, such a big deal that market of course ignores. Not worried if the calls go to zero, will just buy more.\n\nhttps://preview.redd.it/gp0ag8meus9g1.png?width=1111&amp;format=png&amp;auto=webp&amp;s=f6aafe2829a9c32f1b2af5a9846fa14dec915123\n\nhttps://preview.redd.it/osxd9jj9vs9g1.png?width=1567&amp;format=png&amp;auto=webp&amp;s=57b94a27c78e5ecd890a437adb723381b90d6f1e\n\n  \n\n\n  \n",
        "created_utc": 1766864710.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 5 years ago\n**Total Comments** | 68 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "https://preview.redd.it/2eydh7x00t9g1.jpeg?width=320&amp;format=pjpg&amp;auto=webp&amp;s=7e4f8054dac90380dcb43fe88e48788090428ec0\n\ni'm in",
            "brother you own like ~.5% of the company what are you doing here 😭",
            "Hoe Lee Fuck.",
            "https://preview.redd.it/8ah0yy8f2t9g1.jpeg?width=1179&amp;format=pjpg&amp;auto=webp&amp;s=5c73a2295fbf70429356209517910767d8a6e8b2",
            "It's nice to see that you're building a small, reasonable, entry level position here. Good luck fellow PCT regard.",
            "It sounds like you did your research... I'll look at buying a leaps contract on this tomorrow and forget about it for a few months to see how it goes.",
            "Good lord. Im in",
            "What is your approx. timeframe on this?",
            "what is ur plan with those jan calls? is there anything on the horizon with the potential to initiate a rerating of the stock?"
        ]
    },
    {
        "title": "Thoughts on Nutanix? $NTNX",
        "url": "https://i.redd.it/gvw56helws9g1.jpeg",
        "post_text": "Picked up some Calls for $NTNX recently and wanted to see what the consensus is at WSB on the Stock.\n\nThey had a decent quarter, ARR, Revenue and earnings growth but missed hard on the guidance cutting the stock price.\n\nI work in tech nationally. Every company that I talk to (from regional banks and trucking companies to global casinos and the largest retailer on the planet) are switching from VMWare to Nutanix. Broadcom has destroyed VMware and raised the prices killing off the lifetime license model and forcing upgrades - they’re bleeding customers now.\n\nThe only truly viable competition is to go hypervisor and that’s really only for MS customers who are only MS. \n\nThis feels like a long-term win, but I wanted to go check it here. \n\nWhat are you seeing beyond the headlines how do you think the stock will do?\n\n",
        "created_utc": 1766864945.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 190 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Tech guy here.  I’ve heard of many companies who tried to switch and ended up staying with old faithful (VMWare) still despite the 8x approx price increase.  Nutanix is $150-200 per core still.",
            "Nutanix is trash. Requires wayyy too many resources. No DoD customers due to this. VMware is back to being super cheap or even free.",
            "Tech industry as well and have heard similar but this was ages ago now.\n\nCompanies have either made their decision and bit the bullet for a long contract with Broadcom or switched to Nutanix or similar.\n\nHave talked to some that got away from VM's entirely to avoid this.\n\nNot room for much more growth any time soon.",
            "My company has servers hosted in Nutanix. Its trash. But then, company performance and its stock value seems disconnected for a few years now. So we never know.",
            "this has got to be the shittiest profile i have ever read on a company.  i knew i knew what this company did but i just couldn’t remember.  i finally figured out they are just a vcenter/esxi/vsan or xcp-ng alternative but MY GOD is this profile awful.\n\nhttps://preview.redd.it/kgodajvfmy9g1.jpeg?width=1259&amp;format=pjpg&amp;auto=webp&amp;s=e32d2574b640972b41f3ec355775f856e48c06b5",
            "Solid VMware compitor(broadcom) their hyper convergence solutions are the main one everyone went to after vmware changed their licensing model after being aquired by broadcom and fucking over 100% of their customers",
            "Never heard of that company",
            "Long on Nutanix.  We’ve gone their route and their products deliver.",
            "Thoughts on thoughts?"
        ]
    },
    {
        "title": "235% gain YOY all thanks to Silver.",
        "url": "https://www.reddit.com/gallery/1pw9woc",
        "post_text": "Been playing silver long expiration options this year to great success. Current position shown. Holding into 2026. ",
        "created_utc": 1766770438.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 66 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "You sir are the silverback 🥈",
            "Silver is definitely telling us something.  What?  No idea.\n\nEdit:  Silver export ban by China 60-70% of global supply control.  No comments with this anywhere until after market close.",
            "But muh bitcoin is decentralised tho",
            "Cup’n’handle 50 year pattern, decades of paper suppression, 1:350/400 physical to paper ratio, the east standing for delivery of contracts, 111k open interest contracts for march 2026, years of supply:demand deficit, critital mineral, china to limit export as of jan 2026, safe haven vs fiat(gold, plat++ as well), fiat printing, industrial demand, the list is getting long",
            "Congrats \nTake profits",
            "Serious question...  Why bother screwing around and holding a basket of stocks when silver is going to 200 by end of 2026?",
            "interesting to compare with BTC and Platinum. PPLT What does this all mean?",
            "seems like the boomers were right",
            "https://preview.redd.it/lfxp512kql9g1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=890036e008776a334ffc97b17d11b58d30349bab\n\nSame. 80% silver 20% gold"
        ]
    },
    {
        "title": "NVDA 12/26 $190 Calls – Expiration Lottos Saved by $20B Groq Deal News 🚀",
        "url": "https://www.reddit.com/gallery/1pwnu7v",
        "post_text": "Full regard mode: Bought these NVDA Dec 26 ’25 $190 calls super cheap back on 12/19 (avg $0.29) thinking AI daddy might rip one last time before year-end.\n\n40 contracts: \\~$1,165\n\nSold @ $2.38  715%  $8,327 profit locked in 🔥🔥 on expiration day\n\nGroq deal news dropped Christmas Eve and gave NVDA that extra juice – stock ripped intraday (high $192.69) and sent my calls flying right before they could’ve expired worthless 😂\n\nTook profits instead of diamond handing to zero.\n\nScreenshots: position, sell execution.\n\nRegards, good exit. ",
        "created_utc": 1766807146.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Now do that with Puts on NVDA or you're a lucky regard.",
            "Fortune favours the bold but in this case, fortune favoured the regard.",
            "Well done",
            "It's nice to see someone who took profits instead of diamond handing to zero or a loss. Congrats.",
            "Stupid question does Nvidia continue to rise in 2026?"
        ]
    },
    {
        "title": "Hit my first five figure day gain right now, thanks GLD and SLV.",
        "url": "https://i.redd.it/gkyw3429hl9g1.jpeg",
        "post_text": "",
        "created_utc": 1766775029.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 21 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "This is the final sign for the regard apocalypse",
            "fucking metal is now the top meme stock what a wacky year",
            "The year is 2045 mfs are still posting unrealized gains and wondering why it gets deleted 5 minutes later",
            "I thought silver posts get deleted in this sub. Mine were getting deleted 4 years ago for no reason. Sus",
            "silver is going to 100+ in 2026",
            "Silver miners stand to make huge profits in 2026. I'm playing it with SILJ. Silver up 10% today means huge profits for SILJ in 2026.",
            "When did you buy",
            "Holding 10 SLV calls and a friend convinced me to take some profit so I sold two of them, might be a week ago. yesterday the fomo was so bad I bought them back.",
            "Take profits"
        ]
    },
    {
        "title": "5k to 20k to 2k in 8 months",
        "url": "https://www.reddit.com/gallery/1pwhr4s",
        "post_text": "8 months. 944 trades. All options on (mostly) equities, SPX and ETFs. No 0TDEs, always weeklies at the very minimum. Traded verticals, calendars, condors &amp; butterflies. \n\nI genuinely thought I was the smartest guy in the room back in the summer.\n\nAll it took was a bad losing streak late in the summer and before I knew it I was rather arbitrarily martingaling certain positions just to “get back up to where I was”. \n\n8 months of getting Dunning-Kruger’d\n",
        "created_utc": 1766790173.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 10 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "Only regarded people secure their profits\n\nhttps://preview.redd.it/43wt77a5rm9g1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=8e5b3d457a3baf0e6c1c4422fe2e6d9b204de33c",
            "https://preview.redd.it/jfne7g9rym9g1.jpeg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=cbcf6b23045f6f875c5e5c2a4436a5b1993adc01",
            "Just tell yourself you made 20k profit and don’t look at the current balance problem solved.",
            "you still have 2k to go.",
            "OMG 944 trades....",
            "interactive brokies",
            "As the old saying goes, \"Make money by luck, go broke by talent.\"",
            "Whoops",
            "Im also the same, biggest profits in september then lost it all in december er calls now back to 1K"
        ]
    },
    {
        "title": "I think I’ve hit the final straw. Don’t know how much further I can keep going.",
        "url": "https://www.reddit.com/gallery/1pwc78x",
        "post_text": "Everything in my life is complete shit.",
        "created_utc": 1766776095.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 3145 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "\"I don't know how much I can keep going\" is a weird way to frame a gambling problem as a perseverance problem.",
            "Technically you can keep going $4,130.76 more.",
            "Mathematically probably 1 more day.",
            "Complaining about your life while you gamble away your money 😂",
            "Another 4k lottery ticket next week should wipe out your available funds",
            "If it makes you feel any better, even if you hit 100k at some point you still woulda ended up at 0. You're just gambling",
            "Why so many people put the lions share of their money into options is beyond me.\n\nOptions are for when I want to gamble on smaller positions that are risky, not for trying to build up my net worth while working a W2 job.",
            "About $4k further looks like. Come on. One more time and I’m sure you’ll turn it all around.",
            "Lucky for you we know exactly how much further you can go."
        ]
    },
    {
        "title": "SLV gang where are you at?",
        "url": "https://i.redd.it/wbooyh36bk9g1.jpeg",
        "post_text": "Bought these deep ITM leaps a month ago and didn't expect these puppies to jump so fast. And today I wake up to see SLV on the leaderboard. I know WSB ruins everything it touches so im happy with these gains and will sell for a tax free gift. ",
        "created_utc": 1766760877.0,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 348 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](https://discord.gg/wsbverse)",
            "https://preview.redd.it/qyoffbi4kk9g1.jpeg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=f5f76eb93a76d23212dfe4bda959e7b1b5f01b9e\n\nToday is crazy",
            "Ahh fuck slv now on Wall Street bets. I love it lol",
            "I want to buy more but I’m waiting for a dip and it just keeps going up",
            "https://preview.redd.it/fmo0osbibk9g1.jpeg?width=843&amp;format=pjpg&amp;auto=webp&amp;s=212287d9308edf1ee4af66a16e73d2d2b41cf6ad\n\nCongratulations! Let's keep up the good work!",
            "https://preview.redd.it/bgwdt86r3l9g1.jpeg?width=1206&amp;format=pjpg&amp;auto=webp&amp;s=be339a7a2a2cede08e32886d49feaae333ea368f",
            "Silver squeeze in process",
            "Got a sell order set for $75. I know it might hit 80 but im trying not to be such a miserable greedy fuck in 2026.",
            "I'm here, but I still have a year of time, so...\n\nhttps://preview.redd.it/vrknx564mk9g1.png?width=1063&amp;format=png&amp;auto=webp&amp;s=0d57d6d329f69d33e07cf73fbc0b02afcd6abf28",
            "If I’m buying metal, it’s physical."
        ]
    }
]